In [1]:
import sqlite3

def sql_i(instruction,data_b="data2.db"):
    conn=sqlite3.connect(data_b)
    cur=conn.cursor()
    cur.execute(instruction)
    if "select" in instruction.lower() or "pragma" in instruction.lower():
        rows=cur.fetchall()
        conn.close()
        return(rows)
    else:
        conn.commit()  
        conn.close()

In [2]:
sql_i('''
create table PETRESCUE (
	ID INTEGER NOT NULL,
	ANIMAL VARCHAR(20),
	QUANTITY INTEGER,
	COST DECIMAL(6,2),
	RESCUEDATE DATE,
	PRIMARY KEY (ID)
	)
''')

In [3]:
sql_i('''
insert into PETRESCUE values 
	(1,'Cat',9,450.09,'2018-05-29'),
	(2,'Dog',3,666.66,'2018-06-01'),
	(3,'Dog',1,100.00,'2018-06-04'),
	(4,'Parrot',2,50.00,'2018-06-04'),
	(5,'Dog',1,75.75,'2018-06-10'),
	(6,'Hamster',6,60.60,'2018-06-11'),
	(7,'Cat',1,44.44,'2018-06-11'),
	(8,'Goldfish',24,48.48,'2018-06-14'),
	(9,'Dog',2,222.22,'2018-06-15')
''')

In [4]:

head=[]
columns=sql_i("PRAGMA table_info('PETRESCUE')")
for name in columns:
    head.append(name[1])
head

['ID', 'ANIMAL', 'QUANTITY', 'COST', 'RESCUEDATE']

In [5]:
import pandas as pd
PETRESCUE=sql_i("select * from PETRESCUE")
PETRESCUE=pd.DataFrame(PETRESCUE,columns=head)
PETRESCUE

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14
8   9       Dog         2  222.22  2018-06-15

# why used nesed select?!!!

In [6]:
sql_i("select * from PETRESCUE where  COST > avg(cost)")

OperationalError: misuse of aggregate function avg()

## you can't use  max ,min,count,sum,avg after where
## to solve this problem you are going to use sub-select

In [8]:
sql_i('select avg(cost) from PETRESCUE')

[(190.91555555555556,)]

In [9]:
sql_i("select * from PETRESCUE where cost > 190.915")

[(1, 'Cat', 9, 450.09, '2018-05-29'),
 (2, 'Dog', 3, 666.66, '2018-06-01'),
 (9, 'Dog', 2, 222.22, '2018-06-15')]

In [11]:
#use ("select avg(cost) from PETRESCUE")  as a sub select 
sql_i("select * from PETRESCUE where cost > (select avg(cost) from PETRESCUE)")

[(1, 'Cat', 9, 450.09, '2018-05-29'),
 (2, 'Dog', 3, 666.66, '2018-06-01'),
 (9, 'Dog', 2, 222.22, '2018-06-15')]